In [1]:
import numpy as np
import pandas as pd

In [46]:
mo = pd.Series(['A', 'B', 'C', 'D'], name="Mobile Operator")
r = pd.Series([200, 300, 400, 500], name="Revenue")
df = pd.DataFrame({
        'Mobile Operator': mo,
        'Revenue': r
    }).set_index('Mobile Operator')
df

                 Revenue
Mobile Operator
A                    200
B                    300
C                    400
D                    500

In [3]:
new_series = pd.Series([1,2,3,4,5])
print(new_series[0])
print(new_series[0: 3])

1
0    1
1    2
2    3
dtype: int64

In [4]:
new_series[:3]

0    1
1    2
2    3
dtype: int64

In [5]:
new_series[[0,3,4]]

0    1
3    4
4    5
dtype: int64

In [6]:
new_series.index=["A","B","C","D","E"]
print(new_series["D":])

D    4
E    5
dtype: int64

In [7]:
cust_df = pd.DataFrame({

    "cust_id" : [1,2,3,4],
    "gender" : ["m","f","m","f"],
    "location" : ["Avadi","Chennai","Banglore","India"],
    "products_bought" : ["Spin top","glass", "cup", "pen"],
    "quantity" : [1,2,2,3],
    "bill" : [100,20,30,10]
})

print(cust_df)

print(cust_df.loc[0])

   cust_id gender  location products_bought  quantity  bill
0        1      m     Avadi        Spin top         1   100
1        2      f   Chennai           glass         2    20
2        3      m  Banglore             cup         2    30
3        4      f     India             pen         3    10
cust_id                   1
gender                    m
location              Avadi
products_bought    Spin top
quantity                  1
bill                    100
Name: 0, dtype: object

In [8]:
print(cust_df.iloc[0:4, [0, 1]])

   cust_id gender
0        1      m
1        2      f
2        3      m
3        4      f

In [9]:
cust_df.loc[2, "products_bought"] = "Bottle"

In [10]:
print(cust_df)

   cust_id gender  location products_bought  quantity  bill
0        1      m     Avadi        Spin top         1   100
1        2      f   Chennai           glass         2    20
2        3      m  Banglore          Bottle         2    30
3        4      f     India             pen         3    10

In [94]:
cust_df

   cust_id gender  location products_bought  quantity  bill
0        1      m     Avadi        Spin top         1   100
1        2      f   Chennai           glass         2    20
2        3      m  Banglore          Bottle         2    30
3        4      f     India             pen         3    10

In [13]:
cust_df['Rating'] = [1,2,3,4]
cust_df

   cust_id gender  location products_bought  quantity  bill  Rating
0        1      m     Avadi        Spin top         1   100       1
1        2      f   Chennai           glass         2    20       2
2        3      m  Banglore          Bottle         2    30       3
3        4      f     India             pen         3    10       4

In [18]:
cust_df.drop(columns="gender", inplace=True)

KeyError: "['gender'] not found in axis"

In [19]:
cust_df

   cust_id  location products_bought  quantity  bill  Rating
0        1     Avadi        Spin top         1   100       1
1        2   Chennai           glass         2    20       2
2        3  Banglore          Bottle         2    30       3
3        4     India             pen         3    10       4

In [22]:
cust_df.drop(0,axis = 0)

   cust_id  location products_bought  quantity  bill  Rating
1        2   Chennai           glass         2    20       2
2        3  Banglore          Bottle         2    30       3
3        4     India             pen         3    10       4

In [27]:
cust_df.drop(index=[2],inplace=True)

KeyError: '[2] not found in axis'

In [29]:
cust_df.reset_index(drop=True,inplace=True)

In [30]:
cust_df

   cust_id location products_bought  quantity  bill  Rating
0        1    Avadi        Spin top         1   100       1
1        2  Chennai           glass         2    20       2
2        4    India             pen         3    10       4

In [52]:
df=pd.DataFrame({
    "customerId":[101,102,103,104],
    "category":["Medium","Medium","High","Low"],
    "first_visit":["yes","no","yes","yes"],
    "sales":[123,52,214,663]
})

In [53]:
df

   customerId category first_visit  sales
0         101   Medium         yes    123
1         102   Medium          no     52
2         103     High         yes    214
3         104      Low         yes    663

In [54]:
df1  = pd.DataFrame({
    'customerId':[101,103,104,105],
    'distance':[12,9,44,21],
    'sales':[123,214,663,331]},index = [4,5,6,7])

In [55]:
df1

   customerId  distance  sales
4         101        12    123
5         103         9    214
6         104        44    663
7         105        21    331

In [60]:
df_concat1=pd.concat([df,df1])
df_concat1

   customerId category first_visit  sales  distance
0         101   Medium         yes    123       NaN
1         102   Medium          no     52       NaN
2         103     High         yes    214       NaN
3         104      Low         yes    663       NaN
4         101      NaN         NaN    123      12.0
5         103      NaN         NaN    214       9.0
6         104      NaN         NaN    663      44.0
7         105      NaN         NaN    331      21.0

In [61]:
df_concat=pd.concat([df,df1],axis=1)
df_concat

   customerId category first_visit  sales  customerId  distance  sales
0       101.0   Medium         yes  123.0         NaN       NaN    NaN
1       102.0   Medium          no   52.0         NaN       NaN    NaN
2       103.0     High         yes  214.0         NaN       NaN    NaN
3       104.0      Low         yes  663.0         NaN       NaN    NaN
4         NaN      NaN         NaN    NaN       101.0      12.0  123.0
5         NaN      NaN         NaN    NaN       103.0       9.0  214.0
6         NaN      NaN         NaN    NaN       104.0      44.0  663.0
7         NaN      NaN         NaN    NaN       105.0      21.0  331.0

In [63]:
df_outer_merge = pd.merge(df, df1, how="outer", on="customerId")
df_outer_merge

   customerId category first_visit  sales_x  distance  sales_y
0         101   Medium         yes    123.0      12.0    123.0
1         102   Medium          no     52.0       NaN      NaN
2         103     High         yes    214.0       9.0    214.0
3         104      Low         yes    663.0      44.0    663.0
4         105      NaN         NaN      NaN      21.0    331.0

In [66]:
df_inner_merge = pd.merge(df, df1, how="inner", on="customerId")
df_inner_merge

   customerId category first_visit  sales_x  distance  sales_y
0         101   Medium         yes      123        12      123
1         103     High         yes      214         9      214
2         104      Low         yes      663        44      663

In [68]:
df_right_merge = pd.merge(df, df1, how="right", on="customerId")
df_right_merge

   customerId category first_visit  sales_x  distance  sales_y
0         101   Medium         yes    123.0        12      123
1         103     High         yes    214.0         9      214
2         104      Low         yes    663.0        44      663
3         105      NaN         NaN      NaN        21      331

In [69]:
df1 = pd.DataFrame({
'Q3': [301, 302, 303],
'Q4': [401, 402, 403]

}, index=['I0', 'I2', 'I3'])
 
df2 = pd.DataFrame({
'Q1': [101, 102, 103],
'Q2': [201, 202, 203]

}, index=['I0', 'I1', 'I2'])

print(df1)
print(df2)

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403
     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [70]:
df1.join(df2, how='inner')

     Q3   Q4   Q1   Q2
I0  301  401  101  201
I2  302  402  103  203

In [71]:
df1.join(df2, how='left')

     Q3   Q4     Q1     Q2
I0  301  401  101.0  201.0
I2  302  402  103.0  203.0
I3  303  403    NaN    NaN

In [72]:
df1.join(df2, how='right')

       Q3     Q4   Q1   Q2
I0  301.0  401.0  101  201
I1    NaN    NaN  102  202
I2  302.0  402.0  103  203